airtime/reqFP001etreygcu.xml

<?xml version="1.0" encoding="utf-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:api="http://cps.huawei.com/synccpsinterface/api_requestmgr" xmlns:req="http://cps.huawei.com/synccpsinterface/request" xmlns:com="http://cps.huawei.com/synccpsinterface/common">
<soapenv:Header/> 
<soapenv:Body> 
<api:Request> 
<req:Header> 
<req:Version>1.0</req:Version> 
<req:CommandID>InitTrans_2108</req:CommandID> 
<req:OriginatorConversationID>FP001etreygcu</req:OriginatorConversationID> 
<req:Caller> 
<req:CallerType>2</req:CallerType> 
<req:ThirdPartyID>FRESHBAKERY</req:ThirdPartyID> 
<req:Password>fsQfEbZUais=</req:Password> 
<req:ResultURL>https://10.200.209.240:16888/SchemaAPIResult</req:ResultURL> 
</req:Caller> 
<req:KeyOwner>1</req:KeyOwner> 
<req:Timestamp>200515043456</req:Timestamp> 
</req:Header> 
<req:Body> 
<req:Identity> 
<req:Initiator> 
<req:IdentifierType>11</req:IdentifierType> 
<req:Identifier>fresh</req:Identifier> 
<req:SecurityCredential>vcBomeARe/xtQaDtuWqa/g==</req:SecurityCredential> 
<req:ShortCode>827073658</req:ShortCode> 
</req:Initiator> 
</req:Identity> 
<req:TransactionRequest> 
<req:Parameters> 
<req:Parameter> 
<com:Key>RechargedMSISDN</com:Key> 
<com:Value>1.5</com:Value> 
</req:Parameter> 
<req:Amount>USD</req:Amount> 
<req:Currency>wc</req:Currency> 
</req:Parameters> 
</req:TransactionRequest> 
<req:ReferenceData> 
<req:ReferenceItem> 
<com:Key>POSDeviceID</com:Key> 
<com:Value>POS234789</com:Value> 
</req:ReferenceItem> 
</req:ReferenceData> 
</req:Body> 
</api:Request> 
</soapenv:Body> 
</soapenv:Envelope>